app/Controllers/Auth.php

    public function login()
{
    $db = Database::connect();
    $session = session();

    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    $user = $db->table('users')->where('email', $email)->get()->getRow();

    if ($user && password_verify($password, $user->password)) {
        // ✅ Store basic session info
        $sessionData = [
            'user_id'    => $user->id,
            'role'       => $user->role,
            'full_name'  => $user->full_name,
            'isLoggedIn' => true,
        ];

        // ✅ If employer, get company_name from employers table
        if ($user->role === 'employer') {
            $employer = $db->table('employers')->where('user_id', $user->id)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `email` = 'yamaken@gmail.com'
SELECT *
FROM `employers`
WHERE `user_id` = '3'

    public function boss_dashboard()
    {
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'employer') {
            return redirect()->to(site_url('login'));
        }

        $db = Database::connect();
        $employer_id = $session->get('user_id');

        $jobs = $db->table('job_posts')
                   ->where('employer_id', $employer_id)
                   ->orderBy('date_posted', 'DESC')
                   ->get()
                   ->getResultArray();
---
SELECT *
FROM `job_posts`
WHERE `employer_id` = '1'
ORDER BY `date_posted` DESC