app/Controllers/BossJobController.php

    public function editJobPost($jobId = null)
        {
            $session = session();

            if (!$jobId) {
                return redirect()->to('/boss_dashboard')->with('error', 'No job ID provided.');
            }

            $jobModel = new \App\Models\JobPostModel();
            $job = $jobModel->asArray()->find($jobId);


            if (!$job) {
                return redirect()->to('/boss_dashboard')->with('error', 'Job not found.');
            }

            // ✅ Handle POST (update job)
            if ($this->request->getMethod() === 'POST') {

                $updatedData = [
                    'title'        => $this->request->getPost('title'),
                    'description'  => $this->request->getPost('description'),
                    'job_type'     => $this->request->getPost('job_type'),
                    'salary_range' => $this->request->getPost('salary_range'),
                    'company_name' => $this->request->getPost('company_name'),
                ];

                $jobModel->update($jobId, $updatedData);
---
SELECT *
FROM `job_posts`
WHERE `job_posts`.`id` = '6'
UPDATE `job_posts` SET `title` = 'Designer', `description` = 'wow wow wow', `job_type` = 'Part-Time', `salary_range` = '200000', `company_name` = 'Wowie International Airport '
WHERE `job_posts`.`id` IN ('6')