app/Controllers/EmployeeProfile.php

    public function index()
    {
        $session = session();

        if (!$session->has('user_id')) {
            return redirect()->to('/login');
        }

        $user_id = $session->get('user_id');

        $userModel = new UserModel();
        $jobSeekerModel = new JobSeekerModel();

        $emp = $userModel
            ->select('users.id AS user_id, users.full_name, users.email, job_seekers.id AS seeker_id, job_seekers.age, job_seekers.gender, job_seekers.contact_no, job_seekers.profile_picture, job_seekers.resume_path')
            ->join('job_seekers', 'users.id = job_seekers.user_id', 'left')
            ->where('users.id', $user_id)
            ->first();
---
SELECT `users`.`id` AS `user_id`, `users`.`full_name`, `users`.`email`, `job_seekers`.`id` AS `seeker_id`, `job_seekers`.`age`, `job_seekers`.`gender`, `job_seekers`.`contact_no`, `job_seekers`.`profile_picture`, `job_seekers`.`resume_path`
FROM `users`
LEFT JOIN `job_seekers` ON `users`.`id` = `job_seekers`.`user_id`
WHERE `users`.`id` = '4'
 LIMIT 1