app/Controllers/FindJobs.php

SELECT *
FROM `users`
WHERE `id` = '4'
SELECT *
FROM `job_posts`
ORDER BY `date_posted` DESC
SELECT `job_id`
FROM `job_applications`
WHERE `applicant_id` = '4'
---
    public function index()
    {
        $session = session();

        // ✅ Make sure user is logged in
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(site_url('login'));
        }

        $db = Database::connect();
        $user_id = $session->get('user_id');

        // ✅ Get user info
        $user = $db->table('users')->where('id', $user_id)->get()->getRow();

        // ✅ Get all job posts
        $jobs = $db->table('job_posts')
                   ->orderBy('date_posted', 'DESC')
                   ->get()
                   ->getResultArray();

        // ✅ Get list of job IDs user already applied for
        $appliedJobs = $db->table('job_applications')
                          ->select('job_id')
                          ->where('applicant_id', $user_id)
                          ->get()
                          ->getResultArray();