app/Controllers/UpdateStatus.php

    public function update_status()
    {
        $db = \Config\Database::connect();

        $application_id = $this->request->getPost('application_id');
        $status = $this->request->getPost('status');

        if (empty($application_id) || empty($status)) {
            return redirect()->back()->with('error', 'Missing data.');
        }

        $builder = $db->table('job_applications');
        $builder->where('id', $application_id);
        $updated = $builder->update(['status' => $status]);
---
UPDATE `job_applications` SET `status` = 'hired'
WHERE `id` = '32'